package org.example.arrays;

public class CountZeros {

    /**
     * Задача: Подсчитать количество нулей в массиве
     *
     * Условие:
     * Напиши метод, который принимает массив целых чисел
     * и возвращает количество элементов, равных нулю.
     *
     * Примеры:
     * countZeros(new int[]{0, 1, 0, 2, 3}) → 2
     * countZeros(new int[]{4, 5, 6})      → 0
     */

    // TODO: реализуй метод ниже
    public static int countZeros(int[] arr) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(countZeros(new int[]{0, 1, 0, 2, 3})); // 2
        System.out.println(countZeros(new int[]{4, 5, 6}));       // 0
    }
}
