package org.example.arrays;

public class CountNegatives {

    /**
     * Задача: Подсчитать количество отрицательных чисел в массиве
     *
     * Условие:
     * Напиши метод, который принимает массив целых чисел
     * и возвращает количество отрицательных элементов (меньше нуля).
     *
     * Примеры:
     * countNegatives(new int[]{-3, 0, 2, -5, 7}) → 2
     * countNegatives(new int[]{1, 2, 3})        → 0
     */

    // TODO: реализуй метод ниже
    public static int countNegatives(int[] arr) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(countNegatives(new int[]{-3, 0, 2, -5, 7})); // 2
        System.out.println(countNegatives(new int[]{1, 2, 3}));         // 0
    }
}
