package org.example.arrays;

public class CountPositives {

    /**
     * Задача: Подсчёт положительных чисел в массиве
     *
     * Условие:
     * Напиши метод, который принимает массив целых чисел
     * и возвращает количество положительных элементов (строго больше 0).
     *
     * Примеры:
     * countPositives(new int[]{-1, 0, 3, 5, -2}) → 2
     * countPositives(new int[]{1, 2, 3})        → 3
     */

    // TODO: реализуй метод ниже
    public static int countPositives(int[] arr) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(countPositives(new int[]{-1, 0, 3, 5, -2})); // 2
        System.out.println(countPositives(new int[]{1, 2, 3}));         // 3
    }
}
