package org.example.arrays;

public class IsArrayPalindrome {

    /**
     * Задача: Проверка на палиндром
     *
     * Условие:
     * Напиши метод, который проверяет, является ли массив палиндромом.
     * Палиндром — это массив, одинаково читающийся слева направо и справа налево.
     *
     * Примеры:
     * isArrayPalindrome(new int[]{1, 2, 3, 2, 1}) → true
     * isArrayPalindrome(new int[]{1, 2, 3, 4})    → false
     */

    // TODO: реализуй метод ниже
    public static boolean isArrayPalindrome(int[] arr) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(isArrayPalindrome(new int[]{1, 2, 3, 2, 1})); // true
        System.out.println(isArrayPalindrome(new int[]{1, 2, 3, 4}));    // false
    }
}
