package org.example.arrays;

import java.util.Arrays;

public class ShiftRightByOne {

    /**
     * Задача: Сдвиг элементов массива вправо на 1 позицию
     *
     * Условие:
     * Напиши метод, который циклически сдвигает все элементы массива вправо на одну позицию.
     * Последний элемент становится первым, а остальные сдвигаются вправо.
     *
     * Пример:
     * shiftRight(new int[]{1, 2, 3, 4}) → [4, 1, 2, 3]
     */

    // TODO: реализуй метод ниже
    public static void shiftRight(int[] arr) {
        // реализация здесь
    }

    public static void main(String[] args) {
        // Примеры для запуска
        int[] arr1 = {1, 2, 3, 4};
        shiftRight(arr1);
        System.out.println(Arrays.toString(arr1)); // [4, 1, 2, 3]
    }
}
