package org.example.arrays;

public class SumEvenIndices {

    /**
     * Задача: Подсчитать сумму элементов на чётных индексах
     *
     * Условие:
     * Напиши метод, который возвращает сумму всех элементов массива,
     * стоящих на чётных индексах (0, 2, 4, ...).
     *
     * Примеры:
     * sumEvenIndices(new int[]{1, 2, 3, 4, 5}) → 9   // 1 + 3 + 5
     * sumEvenIndices(new int[]{10, 20, 30})   → 40  // 10 + 30
     */

    // TODO: реализуй метод ниже
    public static int sumEvenIndices(int[] arr) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(sumEvenIndices(new int[]{1, 2, 3, 4, 5})); // 9
        System.out.println(sumEvenIndices(new int[]{10, 20, 30}));    // 40
    }
}
