package org.example.strings;

import java.util.Map;

/**
 * Задача: Частота символов
 * <p>
 * Условие:
 * Напиши метод, который принимает строку и возвращает
 * Map<Character, Integer> — где указано, сколько раз каждый символ встречается.
 * Регистр важен. Пробелы и знаки препинания тоже учитываются.
 * <p>
 * Примеры:
 * "aabcc" → {a=2, b=1, c=2}
 * "Hello!" → {H=1, e=1, l=2, o=1, !=1}
 */
public class CharFrequency {

    // TODO: реализуй метод ниже
    public static Map<Character, Integer> charFrequency(String str) {
        // реализация здесь
        return null;
    }

    public static void main(String[] args) {
        System.out.println(charFrequency("Hello!")); // → {H=1, e=1, l=2, o=1, !=1}
    }
}
