package org.example.strings;

/**
 * Задача: Подсчёт гласных в строке
 * <p>
 * Условие:
 * Напиши метод, который возвращает количество гласных букв в строке.
 * Учитываются только английские гласные: a, e, i, o, u (в любом регистре).
 * Пробелы, знаки препинания и другие символы игнорируются.
 * <p>
 * Примеры:
 * "education" → 5
 * "Java" → 2
 * "xyz" → 0
 */
public class CountVowels {

    // TODO: реализуй метод
    public static int countVowels(String str) {
        return 0;
    }

    public static void main(String[] args) {
        System.out.println(countVowels("education")); // → 5
        System.out.println(countVowels("Java"));      // → 2
        System.out.println(countVowels("xyz"));       // → 0
    }
}
