package org.example.strings;

/**
 * Задача: Подсчёт согласных букв
 * <p>
 * Условие:
 * Напиши метод, который возвращает количество согласных букв в строке.
 * Учитывай только латинские буквы. Регистр не важен.
 * Гласные: a, e, i, o, u
 * <p>
 * Примеры:
 * "hello" → 3
 * "Java" → 2
 * "AEIOU" → 0
 */
public class CountConsonants {

    // TODO: реализуй метод
    public static int countConsonants(String str) {
        return 0;
    }

    public static void main(String[] args) {
        System.out.println(countConsonants("hello")); // → 3
        System.out.println(countConsonants("Java"));  // → 2
        System.out.println(countConsonants("AEIOU")); // → 0
    }
}
