package org.example.strings;

/**
 * Задача: Инвертирование регистра
 * <p>
 * Условие:
 * Напиши метод, который меняет регистр каждой буквы:
 * заглавные становятся строчными, строчные — заглавными.
 * Остальные символы остаются без изменений.
 * <p>
 * Примеры:
 * "Hello World!" → "hELLO wORLD!"
 * "Java123" → "jAVA123"
 * "" → ""
 */
public class InvertCase {

    // TODO: реализуй метод
    public static String invertCase(String str) {
        return null;
    }

    public static void main(String[] args) {
        System.out.println(invertCase("Hello World!")); // → "hELLO wORLD!"
        System.out.println(invertCase("Java123"));      // → "jAVA123"
        System.out.println(invertCase(""));             // → ""
    }
}
