package org.example.strings;

/**
 * Задача: Является ли строка палиндромом
 * <p>
 * Условие:
 * Проверь, является ли строка палиндромом.
 * Палиндром — это строка, которая читается одинаково слева направо и справа налево.
 */
public class IsPalindrome {

    // TODO: реализуй метод
    public static boolean isPalindrome(String str) {
        return false;
    }

    public static void main(String[] args) {
        System.out.println(isPalindrome("А роза упала на лапу Азора")); // → true
    }
}
