package org.example.strings;

/**
 * Задача: Удаление повторяющихся символов
 * <p>
 * Условие:
 * Напиши метод, который удаляет из строки все повторяющиеся символы,
 * оставляя только первое вхождение каждого символа.
 * Порядок символов должен сохраняться.
 * <p>
 * Примеры:
 * "programming" → "progamin"
 * "aabbcc" → "abc"
 * "hello world" → "helo wrd"
 */
public class RemoveDuplicates {

    // TODO: реализуй метод
    public static String removeDuplicates(String str) {
        return null;
    }

    public static void main(String[] args) {
        System.out.println(removeDuplicates("programming")); // → "progamin"
        System.out.println(removeDuplicates("aabbcc")); // → "abc"
        System.out.println(removeDuplicates("hello world")); // → "helo wrd"
    }
}
