package org.example.strings;

/**
 * Задача: Удаление подряд идущих дубликатов символов
 * <p>
 * Условие:
 * Напиши метод, который удаляет все подряд идущие одинаковые символы,
 * оставляя только один.
 * <p>
 * Примеры:
 * "aaabbbcccaaa" → "abca"
 * "hellooo" → "helo"
 * "a" → "a"
 */
public class RemoveConsecutiveDuplicates {

    // TODO: реализуй метод
    public static String removeConsecutiveDuplicates(String str) {
        return null;
    }

    public static void main(String[] args) {
        System.out.println(removeConsecutiveDuplicates("aaabbbcccaaa")); // → "abca"
        System.out.println(removeConsecutiveDuplicates("hellooo"));      // → "helo"
        System.out.println(removeConsecutiveDuplicates("a"));            // → "a"
    }
}
