package org.example.strings;

/**
 * Задача: Замена всех вхождений подстроки
 * <p>
 * Условие:
 * Напиши метод, который заменяет все вхождения подстроки `target`
 * на подстроку `replacement` в строке `str`.
 * <p>
 * Примеры:
 * ("aabbcc", "bb", "dd") → "aaddcc"
 * ("hello world", "l", "*") → "he**o wor*d"
 * ("abcabc", "abc", "x") → "xx"
 * <p>
 * Условие: не использовать регулярные выражения.
 */
public class ReplaceSubstring {

    // TODO: реализуй метод
    public static String replaceSubstring(String str, String target, String replacement) {
        return null;
    }

    public static void main(String[] args) {
        System.out.println(replaceSubstring("aabbcc", "bb", "dd")); // → "aaddcc"
    }
}
