package org.example.strings;

/**
 * Задача: Замена всех заглавных букв на строчные
 * <p>
 * Условие:
 * Напиши метод, который заменяет в строке все заглавные латинские буквы
 * на строчные. Остальные символы не изменяются.
 */
public class ToLowerOnlyUppercase {

    // TODO: реализуй метод
    public static String toLowerOnlyUppercase(String str) {
        return ""; // реализация метода
    }

    public static void main(String[] args) {
        // Примеры входных данных:
        System.out.println(toLowerOnlyUppercase("Hello WORLD!")); // hello world!
        System.out.println(toLowerOnlyUppercase("Java123")); // java123
        System.out.println(toLowerOnlyUppercase("")); // ""
    }
}
