package org.example.strings;

/**
 * Задача: Преобразование в Title Case
 * <p>
 * Условие:
 * Напиши метод, который делает первую букву каждого слова заглавной,
 * а все остальные — строчными.
 */
public class ToTitleCase {

    // TODO: реализуй метод
    public static String toTitleCase(String str) {
        return ""; // реализация метода
    }

    public static void main(String[] args) {
        // Примеры входных данных:
        System.out.println(toTitleCase("java is powerful")); //Java Is Powerful
    }
}
