package org.example.arithmetics;

public class AllDigitsOdd {

    /**
     * Задача: Все ли цифры нечётные
     *
     * Условие:
     * Напиши метод, который проверяет, что в числе `n` все цифры нечётные.
     *
     * Примеры:
     * allDigitsOdd(135)   → true
     * allDigitsOdd(1235)  → false
     * allDigitsOdd(9)     → true
     * allDigitsOdd(2468)  → false
     */

    // TODO: реализуй метод ниже
    public static boolean allDigitsOdd(int n) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(allDigitsOdd(135));   // true
        System.out.println(allDigitsOdd(1235));  // false
        System.out.println(allDigitsOdd(9));     // true
        System.out.println(allDigitsOdd(2468));  // false
    }
}
