package org.example.arithmetics;

public class CountZeros {

    /**
     * Задача: Количество нулей в числе
     *
     * Условие:
     * Напиши метод, который возвращает, сколько цифр 0 содержится в числе `n`.
     *
     * Примеры:
     * countZeros(1050)   → 2
     * countZeros(0)      → 1
     * countZeros(123456) → 0
     */

    // TODO: реализуй метод ниже
    public static int countZeros(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(countZeros(1050));     // 2
        System.out.println(countZeros(0));        // 1
        System.out.println(countZeros(123456));   // 0
    }
}
