package org.example.arithmetics;

public class CountDivisors {

    /**
     * Задача: Подсчёт делителей числа
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число `n`
     * и возвращает количество его целых положительных делителей.
     *
     * Пример:
     * countDivisors(6)  → 4  // делители: 1, 2, 3, 6
     * countDivisors(10) → 4  // делители: 1, 2, 5, 10
     * countDivisors(13) → 2  // делители: 1, 13
     */

    // TODO: реализуй метод ниже
    public static int countDivisors(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(countDivisors(6));   // 4
        System.out.println(countDivisors(10));  // 4
        System.out.println(countDivisors(13));  // 2
    }
}
