package org.example.arithmetics;

public class DigitRange {

    /**
     * Задача: Разность между максимальной и минимальной цифрой
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число `n`
     * и возвращает разницу между самой большой и самой маленькой цифрой в этом числе.
     *
     * Примеры:
     * digitRange(5912) → 8  // max = 9, min = 1
     * digitRange(4444) → 0  // max = 4, min = 4
     * digitRange(83)   → 5  // max = 8, min = 3
     */

    // TODO: реализуй метод ниже
    public static int digitRange(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(digitRange(5912)); // 8
        System.out.println(digitRange(4444)); // 0
        System.out.println(digitRange(83));   // 5
    }
}
