package org.example.arithmetics;

public class DigitFrequency {

    /**
     * Задача: Частота цифры
     *
     * Условие:
     * Напиши метод, который принимает число `n` и цифру `digit` (от 0 до 9),
     * и возвращает, сколько раз эта цифра встречается в числе.
     *
     * Примеры:
     * countDigitFrequency(122333, 3) → 3
     * countDigitFrequency(1001, 0)   → 2
     */

    // TODO: реализуй метод ниже
    public static int countDigitFrequency(int n, int digit) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(countDigitFrequency(122333, 3)); // 3
        System.out.println(countDigitFrequency(1001, 0));   // 2
    }
}
