package org.example.arithmetics;

public class DigitSum {

    /**
     * Задача: Сумма цифр числа
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число
     * и возвращает сумму всех его цифр.
     *
     * Примеры:
     * digitSum(1234) → 10
     * digitSum(0)    → 0
     */

    // TODO: реализуй метод ниже
    public static int digitSum(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(digitSum(1234)); // 10
        System.out.println(digitSum(0));    // 0
    }
}
