package org.example.arithmetics;

public class Factorial {

    /**
     * Задача: Факториал числа
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число `n`
     * и возвращает его факториал.
     *
     * n! = 1 × 2 × 3 × ... × n
     *
     * Примеры:
     * factorial(1) → 1
     * factorial(3) → 6
     * factorial(5) → 120
     */

    // TODO: реализуй метод ниже
    public static int factorial(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(factorial(1)); // 1
        System.out.println(factorial(3)); // 6
        System.out.println(factorial(5)); // 120
    }
}
