package org.example.arithmetics;

public class IsAlternatingDigits {

    /**
     * Задача: Цифры чередуются по чётности
     *
     * Условие:
     * Напиши метод, который проверяет, чередуются ли чётные и нечётные цифры в числе `n`.
     *
     * Примеры:
     * isAlternatingDigits(272727) → true
     * isAlternatingDigits(135)    → false
     * isAlternatingDigits(8)      → true  // одна цифра — это чередование по умолчанию
     * isAlternatingDigits(2824)   → false
     */

    // TODO: реализуй метод ниже
    public static boolean isAlternatingDigits(int n) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(isAlternatingDigits(272727)); // true
        System.out.println(isAlternatingDigits(135));    // false
        System.out.println(isAlternatingDigits(8));      // true
        System.out.println(isAlternatingDigits(2824));   // false
    }
}
