package org.example.arithmetics;

public class IsDigitsDecreasing {

    /**
     * Задача: Цифры идут по убыванию (слева направо)
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число `n`
     * и возвращает true, если все его цифры строго убывают слева направо.
     *
     * Примеры:
     * isDigitsDecreasing(531)   → true
     * isDigitsDecreasing(86420) → true
     * isDigitsDecreasing(9876)  → true
     * isDigitsDecreasing(998)   → false
     * isDigitsDecreasing(123)   → false
     */

    // TODO: реализуй метод ниже
    public static boolean isDigitsDecreasing(int n) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(isDigitsDecreasing(531));   // true
        System.out.println(isDigitsDecreasing(86420)); // true
        System.out.println(isDigitsDecreasing(9876));  // true
        System.out.println(isDigitsDecreasing(998));   // false
        System.out.println(isDigitsDecreasing(123));   // false
    }
}
