package org.example.arithmetics;

public class IsPalindrome {

    /**
     * Задача: Является ли число палиндромом
     *
     * Условие:
     * Напиши метод, который проверяет, является ли целое положительное число палиндромом.
     * Палиндром — это число, которое одинаково читается слева направо и справа налево.
     *
     * Примеры:
     * isPalindrome(121)   → true
     * isPalindrome(12321) → true
     * isPalindrome(1234)  → false
     */

    // TODO: реализуй метод ниже
    public static boolean isPalindrome(int n) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(isPalindrome(121));   // true
        System.out.println(isPalindrome(12321)); // true
        System.out.println(isPalindrome(1234));  // false
    }
}
