package org.example.arithmetics;

public class IsPerfectNumber {

    /**
     * Задача: Является ли число совершенным
     *
     * Условие:
     * Совершенное число — это число, которое равно сумме всех своих собственных делителей, кроме самого себя.
     *
     * Примеры:
     * isPerfect(6)  → true   // 1 + 2 + 3 = 6
     * isPerfect(28) → true   // 1 + 2 + 4 + 7 + 14 = 28
     * isPerfect(12) → false  // 1 + 2 + 3 + 4 + 6 = 16
     */

    // TODO: реализуй метод ниже
    public static boolean isPerfect(int n) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(isPerfect(6));   // true
        System.out.println(isPerfect(28));  // true
        System.out.println(isPerfect(12));  // false
    }
}
