package org.example.arithmetics;

public class IsPrime {

    /**
     * Задача: Является ли число простым
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число `n`
     * и возвращает true, если это число простое.
     *
     * Простое число — это число больше 1, которое делится только на 1 и само себя.
     *
     * Примеры:
     * isPrime(1)  → false
     * isPrime(2)  → true
     * isPrime(3)  → true
     * isPrime(4)  → false
     * isPrime(17) → true
     * isPrime(20) → false
     */

    // TODO: реализуй метод ниже
    public static boolean isPrime(int n) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(isPrime(1));   // false
        System.out.println(isPrime(2));   // true
        System.out.println(isPrime(3));   // true
        System.out.println(isPrime(4));   // false
        System.out.println(isPrime(17));  // true
        System.out.println(isPrime(20));  // false
    }
}
