package org.example.arithmetics;

public class PowerOfTwo {

    /**
     * Задача: Является ли число степенью двойки
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число `n`
     * и возвращает true, если оно является степенью двойки.
     *
     * Примеры:
     * isPowerOfTwo(1)  → true   // 2^0 = 1
     * isPowerOfTwo(2)  → true   // 2^1
     * isPowerOfTwo(4)  → true   // 2^2
     * isPowerOfTwo(6)  → false
     * isPowerOfTwo(16) → true   // 2^4
     */

    // TODO: реализуй метод ниже
    public static boolean isPowerOfTwo(int n) {
        // реализация здесь
        return false;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(isPowerOfTwo(1));   // true
        System.out.println(isPowerOfTwo(2));   // true
        System.out.println(isPowerOfTwo(4));   // true
        System.out.println(isPowerOfTwo(6));   // false
        System.out.println(isPowerOfTwo(16));  // true
    }
}
