package org.example.arithmetics;

public class Power {

    /**
     * Задача: Возведение числа в степень
     *
     * Условие:
     * Напиши метод, который принимает два целых положительных числа `base` и `exponent`,
     * и возвращает результат возведения base в степень exponent.
     *
     * Примеры:
     * power(2, 3) → 8
     * power(5, 0) → 1
     * power(3, 4) → 81
     */

    // TODO: реализуй метод ниже
    public static int power(int base, int exponent) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(power(2, 3)); // 8
        System.out.println(power(5, 0)); // 1
        System.out.println(power(3, 4)); // 81
    }
}
