package org.example.arithmetics;

public class ReverseNumber {

    /**
     * Задача: Разворот числа
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число
     * и возвращает его цифры в обратном порядке.
     *
     * Примеры:
     * reverseNumber(1234) → 4321
     * reverseNumber(1050) → 501
     */

    // TODO: реализуй метод ниже
    public static int reverseNumber(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(reverseNumber(1234)); // 4321
        System.out.println(reverseNumber(1050)); // 501
    }
}
