package org.example.arithmetics;

public class SumEvenDigits {

    /**
     * Задача: Сумма чётных цифр числа
     *
     * Условие:
     * Напиши метод, который принимает положительное целое число `n`
     * и возвращает сумму всех чётных цифр в этом числе.
     *
     * Примеры:
     * sumEvenDigits(123456) → 12  // 2 + 4 + 6
     * sumEvenDigits(111)    → 0
     */

    // TODO: реализуй метод ниже
    public static int sumEvenDigits(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(sumEvenDigits(123456)); // 12
        System.out.println(sumEvenDigits(111));    // 0
    }
}
