package org.example.arithmetics;

public class SumUpTo {

    /**
     * Задача: Сумма чисел от 1 до n
     *
     * Условие:
     * Напиши метод, который возвращает сумму всех чисел от 1 до n включительно.
     *
     * Примеры:
     * sumUpTo(1) → 1
     * sumUpTo(3) → 6  // 1 + 2 + 3
     * sumUpTo(5) → 15 // 1 + 2 + 3 + 4 + 5
     */

    // TODO: реализуй метод ниже
    public static int sumUpTo(int n) {
        // реализация здесь
        return 0;
    }

    public static void main(String[] args) {
        // Примеры для запуска
        System.out.println(sumUpTo(1)); // 1
        System.out.println(sumUpTo(3)); // 6
        System.out.println(sumUpTo(5)); // 15
    }
}